const AboutUs = () => {
  return (
    <div className="panel">
      <div className="panel--header with-border">
        <h3 className="panel--title">გაყიდული უჯრების რაოდენობა</h3>
        <button className="button button--icon button--text button-pull-right is-rounded">
          <svg
            width="14"
            height="8"
            viewBox="0 0 14 8"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M7.00072 5.172L11.9507 0.222L13.3647 1.636L7.00072 8L0.636719 1.636L2.05072 0.222L7.00072 5.172Z"
              fill="currentColor"
            />
          </svg>
        </button>
      </div>
      <div className="panel--content">
        <p>
          Hungryman - ეს არის 3 განუყრელი მეგობრის გასართობი და იუმორისტული არხი.
          თორნიკე ჭყონია - თორნიკე - იდეების გენერატორი და ფულის უაზროდ მფლანგველი,
          მეგობრობს შავ იუმორთან, უყვარს ხინკალი, მწვადი და ოღრაშული დროსტარება.
          ნიკოლოზ ვასაძე - ვასა - ყოველთვის პოზიტიური, თვლის, რომ განსაკუთრებული
          გემოვნება აქვს, უყვარს ყველაფერი აზიური (მასაზის გარდა), მეგობრებში
          ცნობილია როგორც სპონსორების რისხვა. გუგა ჭყონია - გუგა - ოპერატორი,
          მემონტაჟე, პაროდისტი, მუსიკოსი და ბითბოქსერი, ყველაფერი ერთად, თუმცა თავის
          დროზე კამერის მიღმა ყოფნა ამჯობინა, სხვანაირად ამ ვიდეოებს ვერ მივიღებდით.
        </p>
      </div>
    </div>
  );
};

export default AboutUs;
