import { useEffect } from 'react';
import { useNavigate } from 'react-router-dom';
import Button from '../../components/shared/Button';
import { useSelector } from '../../hooks/useSelector';
import './product-order.component.scss';
import { generatePath } from '../../helpers';

const Invoice = () => {
  const navigate = useNavigate();
  const data = useSelector((state) => state.cubesReducer.purchaseDetail?.invoiceUrl);

  useEffect(() => {
    if (!data) {
      navigate('/cubes');
    }
  }, [data]);

  return (
    <div className="wrapper">
      <div className="panel without-header product-order">
        <div className="panel--content">
          <svg fill="none" viewBox="0 0 117 129" style={{ width: '117px' }}>
            <path
              fill="#112231"
              d="M70.606 110.742c25.624 0 46.396-20.734 46.396-46.31s-20.772-46.31-46.396-46.31c-25.623 0-46.395 20.734-46.395 46.31s20.772 46.31 46.395 46.31Z"
            />
            <path
              fill="#55687A"
              d="M108.931 126.851H36.309V114.77h72.622a6.047 6.047 0 0 1 6.053 6.042c0 3.337-2.71 6.041-6.053 6.041v-.002ZM68.586 6.022 88.757 26.16H68.586V6.022Z"
            />
            <path
              fill="#233C52"
              d="M0 129V0h60.516c5.56 0 10.086 4.517 10.086 10.067v14.095h14.12c5.561 0 10.086 4.517 10.086 10.067v74.502h-4.035V34.229c0-3.332-2.715-6.042-6.053-6.042H66.564v-18.12c0-3.332-2.715-6.042-6.053-6.042H4.035v120.942l12.1-.017v4.028L0 129Z"
            />
            <path
              fill="#233C52"
              d="m67.955 3.267-2.853 2.849 24.207 24.162 2.853-2.848L67.955 3.267Zm4.665 99.422a2.005 2.005 0 0 1-1.425-.591l-4.625-4.617-4.625 4.617a2.02 2.02 0 0 1-2.853 0 2.01 2.01 0 0 1 0-2.849l6.053-6.041a2.019 2.019 0 0 1 2.853 0l4.625 4.616 4.625-4.616a2.019 2.019 0 0 1 2.853 0 2.01 2.01 0 0 1 0 2.848l-6.053 6.042c-.393.392-.91.591-1.425.591h-.003Zm6.052-18.12H60.516v4.028h18.156v-4.028Zm0-8.056H60.516v4.028h18.156v-4.028Zm30.261 52.352h-74.64v-16.109h40.345v4.028h-36.31v8.053h70.605a4.036 4.036 0 0 0 4.035-4.028 4.036 4.036 0 0 0-4.035-4.028v-4.028c4.45 0 8.068 3.614 8.068 8.053 0 4.44-3.62 8.053-8.068 8.053v.006Z"
            />
            <path
              fill="#233C52"
              d="M36.308 126.851h-14.12V114.77h14.12v4.028H26.223v4.028h10.085v4.025Z"
            />
            <path
              fill="#233C52"
              d="M24.21 118.798h-6.054v4.028h6.053v-4.028Zm50.43-4.028h-4.034v12.081h4.035V114.77Zm34.291-2.014h-30.26v4.028h30.26v-4.028ZM22.189 46.293c-4.45 0-8.068-3.614-8.068-8.053 0-4.44 3.62-8.053 8.068-8.053 4.448 0 8.068 3.613 8.068 8.053 0 4.44-3.62 8.053-8.068 8.053Zm0-12.08a4.036 4.036 0 0 0-4.035 4.027 4.036 4.036 0 0 0 8.07 0 4.036 4.036 0 0 0-4.035-4.028ZM18.155 66.43c-.474 0-.947-.163-1.329-.498a2.01 2.01 0 0 1-.19-2.84l28.241-32.217a2.016 2.016 0 0 1 2.845-.19 2.01 2.01 0 0 1 .191 2.84L19.672 65.741a2.011 2.011 0 0 1-1.52.688h.003Zm24.205 0c-4.45 0-8.067-3.614-8.067-8.053 0-4.44 3.62-8.053 8.068-8.053 4.448 0 8.068 3.613 8.068 8.053 0 4.44-3.62 8.053-8.068 8.053Zm0-12.081a4.036 4.036 0 0 0-4.035 4.028 4.036 4.036 0 0 0 8.071 0 4.036 4.036 0 0 0-4.035-4.028Z"
            />
          </svg>

          <h2 className="product-order--title">ინვოისი წარმატებით გაიგზავნა</h2>

          <p className="product-order--description">
            ინვოისის გაგზავნიდან რამოდენიმე დღეში აისახება თქვენი შეკვეთა
            დამატებითი ინფორმაციისთვის დაგვიკავშირდით
          </p>

          <p>
            ინფორმაცია საჭირო GST ინვოისში CGST წესების 46-ე წესი ეხება ინვოისის
            შინაარსს. გაცემული საგადასახადო ანგარიშ-ფაქტურა მკაფიოდ უნდა
            მიუთითებდეს ინფორმაციას შემდეგი 16 სათაურით: მიმწოდებლის სახელი,
            მისამართი და GSTIN საგადასახადო ინვოისის ნომერი 16 სიმბოლომდე (ის უნდა
            იყოს გენერირებული თანმიმდევრულად და თითოეულ საგადასახადო ინვოისს
            ექნება უნიკალური ნომერი იმ ფინანსური წლისთვის) Გაცემის თარიღი თუ
            მყიდველი (მიმღები) რეგისტრირებულია, მაშინ მიმღების სახელი, მისამართი
            და GSTIN თუ მიმღები არ არის რეგისტრირებული და ღირებულება აღემატება
            50,000 ლარს*, მაშინ ინვოისი უნდა შეიცავდეს: სახელმწიფო სახელი და
            სახელმწიფო კოდი ** საქონლის/მომსახურების აღწერა საქონლის რაოდენობა
            (ნომერი) და ერთეული UQC-ში (მეტრი, კგ და ა.შ.) საქონლის/მომსახურების
            მიწოდების ჯამური ღირებულება მიწოდების დასაბეგრი ღირებულება ნებისმიერი
            ფასდაკლების კორექტირების შემდეგ GST-ის მოქმედი განაკვეთი (CGST, SGST,
            IGST, UTGST და Cess-ის განაკვეთები ნათლად არის აღნიშნული) გადასახადის
            ოდენობა (CGST, SGST, IGST, UTGST და Cess თანხების დაშლით) მიწოდების
            ადგილი და დანიშნულების სახელმწიფოს დასახელება სახელმწიფოთაშორისი
            რეალიზაციისათვის მიწოდების მისამართი, თუ იგი განსხვავდება მიწოდების
            ადგილისგან გადასახდელია თუ არა GST უკუ გადახდის საფუძველზე მიმწოდებლის
            ან მისი უფლებამოსილი წარმომადგენლის ხელმოწერა * ასევე, უნდა
            გამოცხადდეს, თუ ღირებულება 50,000 ლარზე ნაკლებია, მხოლოდ მაშინ,
            როდესაც მიმღები ითხოვს დეტალებს. ** თუ საქმე არის ექსპორტი
            არარეგისტრირებულ მიმღებზე 50000 ლარამდე ღირებულების, მაშინ საჭიროა
            დანიშნულების ქვეყნის დასახელება. *** HSN კოდის მოხსენება შემდეგია
            ბიზნესისთვის, 2021 წლის 1 აპრილიდან: 5 მილიონი რუბლის ზემოთ ბრუნვამ
            უნდა გამოიყენოს 6-ნიშნა HSN კოდი ყველა ინვოისისთვის 5 მილიონ რუბლზე
            ნაკლები ან ტოლი ბრუნვა უნდა გამოიყენოს 4-ნიშნა HSN კოდი ყველა B2B
            ინვოისისთვის. თუმცა, ეს მოხსენება არჩევითია B2C ინვოისებისთვის. ადრე,
            2021 წლის 31 მარტამდე, ანგარიშგება იყო შემდეგი ბიზნესისთვის 1,5 კრონზე
            ნაკლები ბრუნვა - HSN კოდის მითითება არ არის საჭირო ბრუნვა 1,5 -5 კრონს
            შორის შეიძლება გამოიყენოს 2-ნიშნა HSN კოდი 5 კრონზე მეტი ბრუნვა უნდა
            გამოიყენოს 4-ნიშნა HSN კოდი დადასტურება ინვოისზე GST-ით ექსპორტისთვის
            გარკვეული ინვოისები GST-ის ფარგლებში უნდა საჭიროებდეს დადასტურებას ან
            აღნიშვნას ინვოისზე. საქმეები მოიცავს საქონლისა და მომსახურების
            ექსპორტს და მიწოდებას SEZ-ის ერთეულებისთვის ან დეველოპერებისთვის
            ავტორიზებული ოპერაციებისთვის შემდეგ პირობებში:
          </p>
          <Button
            type="secondary"
            handleClick={() => {
              if (data) {
                window.open(generatePath(data), '_blank');
              }
            }}
          >
            ჩამოტვირთვა
          </Button>
        </div>
      </div>
    </div>
  );
};

export default Invoice;
